// 1. Сөздөрдү тизмектеги тапшыруу:
// Задача:
// Функция түзүңүз, ал тизмекти кабыл алат жана сөздөрдү тескери өзгөртүп, жаңы тизмени кайтарат.
// Пример ввода:
// reverseWords("Hello world");
// Пример вывода:
// "olleH dlrow"
// let str = "Hello world";
// function task(str) {
//   return str.split().reverse().join();
// }
// console.log(task("Hello world"));


// 2. Санды тескери массивге айлантуу:
// Задача:
// Функция түзүңүз, ал терс эмес сандын сандык цифраларын тескери массивде кайтарат.
// Пример ввода:
// reverseNumber(12345);
// Пример вывода:
// [5, 4, 3, 2, 1]

// function task2(num) {
//   return num.split("").reverse()
// }
// console.log(task2("12345"));

// 3. Эң чоң жана эң кичине санды чыгарып, калгандарын кошуу:
// Задача:
// Функция түзүңүз, ал массивдин бардык сандарына эң чоң жана эң кичине сандарды чыгарбай, калгандарын кошот.
// Пример ввода:
// sumExcludingMinMax([1, 2, 3, 4, 5]);
// Пример вывода:
// 9

// 4. Эксламация белгисин алып салуу:
// Задача:
// Функция түзүңүз, ал бардык эксламация белгисин чыгарып салып, калганынын текстин кайтарат.
// Пример ввода:
// removeExclamationMarks("Hello world!!!");
// Пример вывода:
// "Hello world"

// 5. Ар бир символдун регистрин алмаштыруу:
// Задача:
// Функция түзүңүз, ал берилиш катары сөздүн тизмесин алат, ар бир символдун регистрин алмаштырып, жаңы текст кайтарат.
// Пример ввода:
// toggleCase("Hello World");
// Пример вывода:
// "hELLO wORLD"

// 6. Цикл колдонуп ромб түзүү:
// Задача:
// Цикл колдонуп төмөнкү ромбту басып чыгаруу:
// *
// **
// ***
// ****
// *****
// ****
// ***
// **
// *

// 7. Массивдин эң чоң сандарын кайтаруу:
// Задача:
// Массив берилген жана n айнымалыйы бар, ал массивдин эң чоң сандарын кайтаруу керек.
// Пример ввода:
// getLargestNumbers([1, 3, 5, 2, 8, 7], 3);
// Пример вывода:
// [8, 7, 5]

// 8. Массивдин ортосундагы индекстеги санды кайтаруу:
// Задача:
// `arr = [1, 3, 6, 4, 6, 3, 8, 9, 0, 3]` массиви берилген, 3 индексиндеги элементти кайтаруу керек.
// Пример ввода:
// getMiddleElement([1, 3, 6, 4, 6, 3, 8, 9, 0, 3], 3);
// Пример вывода:
// 4

// 9. "hello_world_hello" форматындагы текстти "helloWorldHello" форматына өзгөртүү:
// Задача:
// Берилген текстти өзгөртүү. Мисалы: "hello_world_hello" => "helloWorldHello"
// Пример ввода:
// convertToCamelCase("hello_world_hello");
// Пример вывода:
// "helloWorldHello"

// 10. Палиндром сандардын тизмеси:
// Задача:
// Берилген массивден палиндром сандарды табуу керек (палиндром — солдон оңго жана оңдон солго бирдей окулган сан).
// Пример ввода:
// findPalindromes([121, 1331, 123, 545, 12321]);
// Пример вывода:
// let arr = [121, 1331, 545, 12321];

// function task5(num) {
// return num.filter((el) => {
//     if (el.toString().split("").reverse().join("") === el.toString()) {
//         return el
//     } else {
//         alert("404")
//     }
// })
// }
// console.log(task5([121, 1331, 545, 12321]));

// 11. 2010-жылдан эски унааларга 35% жеңилдик берүү:
// Задача:
// Берилген массивден 2010-жылдан эски унааларга 35% жеңилдик берүү үчүн, жеңилдикти `sale` деген мүнөздөмөдө көрсөтүү керек.
// Пример ввода:
// applyDiscount([{mark: 'Wolksvagen', year: 2005, price: 8000, sale: 0}, ...]);
// Пример вывода:
// let arr = [{mark: 'Wolksvagen', year: 2005, price: 8000, sale: 35}, ...]

// function task6(arr) {
//   return arr.map((el) => {
//     if (el.year > 2010) {
//       el.price = el.price - (el.price * 100) / 35;
//     } else {
//       el;
//     }
//   });
// }
// console.log(task6([{ mark: "Wolksvagen", year: 2015, price: 8000, sale: 35 }]));

// 12. Эң узун сөздү табуу:
// Задача:
// Берилген тексттен эң узун сөздү табуу керек.
// Пример ввода:
// findLongestWord("I am a Megalodon, oceans feeling like a pond");
// Пример вывода:
// "Megaladon"



