// 1. Проверка первой буквы
// Пользователь вводит строку. Нужно проверить, начинается ли строка с буквы "A". Если да — вывести "Строка начинается с A", если нет — "Строка не начинается с A".
// let str = "Ananas";
// if (str[0] === "A") {
//   console.log("Строка начинается с A");
// } else {
//   console.log("Строка не начинается с A");
// }

// 2. Определение длины строки
// Пользователь вводит строку. Нужно вывести длину этой строки.
// let str = "jasmina";
// console.log(str.length);

// 3. Сравнение строк
// Пользователь вводит две строки. Нужно сравнить их. Если строки одинаковые, вывести "Строки равны", если разные — "Строки не равны".
// let str = "school"
// let str1 ="school"
// if (str===str1) {
//     console.log("Строки равны");
// } else {
//     console.log("Строки не равны");
// }

// 4. Проверка последней буквы
// Пользователь вводит строку. Нужно проверить, заканчивается ли строка на букву "Z". Если да — вывести "Строка заканчивается на Z", если нет — "Строка не заканчивается на Z".
// let str = "motionZ1"
// if (str.slice(-1)) {
//     console.log("Строка заканчивается на Z");
// } else {
//     console.log("Строка не заканчивается на Z");
// }

// 5. Проверка длины строки
// Пользователь вводит строку. Нужно проверить, равна ли длина строки 5. Если да — вывести "Длина строки равна 5", если нет — "Длина строки не равна 5".
// let str = "Ailin"
// if (str.length===5) {
//     console.log("Длина строки равна 5");
// } else {
//     console.log("Длина строки не равна 5");
// }
// 6. Проверка наличия пробела
// Пользователь вводит строку. Нужно проверить, содержит ли строка пробел. Если да — вывести "Строка содержит пробел", если нет — "Пробелов нет".
// let str = "motion web";
// if (str.includes(" ")) {
//   console.log("Строка содержит пробел");
// } else {
//   console.log("Пробелов нет");
// } 

// 7. Удаление последнего символа
// Пользователь вводит строку. Нужно удалить последний символ строки и вывести результат.
// let str = "kyrgyzstan";
// console.log(str.slice(0, -1));






