//JavaScript
//Date Type - типы данных - маалымат турлору:8

// number - сандар 123456789
// string - жазуулар
// boolean - true , false
// undefined - белгисиз
// null - 0 жок
// bigint - чон сандар млн, трлн, блн.
// symbol - + - * / =
// object - {}

// тип данныйлар  1-примитивный  2-ссылычный болуп 2ге болунот .
// жетоосу примитивныйга кирет
// бир гана object ссылычный .

// переменные:3
// var -----x - старый версия
// let ---- озгорот
// const - озгорбойт


// Math методдору:
// console.log(Math.abs); - санды + кылат (1 параметр алат (сан))
// console.log(Math.pow(3,2)); даражага которот ** (2 параметр алат (сан))
// console.log(Math.sqrt()); тамырдан чыгарат (1 параметр алат (сан))
// console.log(Math.floor()); пол (1 пр алат (сан))
// console.log(Math.ceil()); паталок (1 пр алат (сан))
// console.log(Math.round()); 5.5 (1 пр алат (сан))
// console.log(Math.random()); рандомный сандар 0 - 1 чейин (пр кабыл албайт )
// console.log(Math.trunc()); точкадан кийинки санды окубайт (1 пр алат (сан) )

// console.log(str.slice());

// Exercise-1

// let year = 2024;
// console.log(year / 100);
// console.log(Math.ceil(year / 100));
// let.jasi = 3031
// console.log(Math.round())

// Home-work
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a=10 , b=2 , c=5
// console.log(a+b+c)

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let num=100
// console.log(num*2)

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let nums =67
// console.log(nums%7)

// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность,
// произведение и частное (результат деления).
// let a=10
// let b = 2
// console.log(a + b)

// let a=10
// let b=2
// console.log(a-b)

// let a=10
// let b=2
// console.log(a*b)

// let a=10
// let b=2
// console.log(a/b)

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной
//  result. Выведите в консоль значение переменной result.
// let c=15
// let =2
// console.log(c*2)

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c.
//  Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30;
// let b = 15;
// let v = a + b;
// let c = v % 4;
// console.log(c);

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат
// присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите
// переменные c и d, а результат запишите в переменную result.
// Выведите в консоль значение переменной result.
// let a=17 , b=10
// let c = a-b
// let d = 7
// let result = c/d
// console.log(result);
